f = open(r"D:\Downloads\Tencent_AILab_ChineseEmbedding\Tencent_AILab_ChineseEmbedding.txt",'r',encoding='UTF-8')
Yixiang = ['四弦琴','鼓','大号','歌声','茄子','豌豆','西红柿','蔬菜','苦瓜种子','种子','萝卜','果实','石头','围墙','城堡','水','沐浴露','野餐食品','鸡蛋','奶酪饼干','蛋糕','浓汤','糯米糖','米粒','三明治','红枣','背心裙','碎花蓝裙','衣裳','毯子','乌龟壳','衣服','时间','绿阳光','红阳光','白阳光','金阳光','太阳','云','圆','邀请卡','扫帚','小木马','南瓜灯','魔棒','彩旗','海盗旗','信','礼物','肥皂泡','熊宝宝','鸟儿','兔子','飞龙','鱼','蜜蜂','小鸟','蚊子','蜻蜓','小鱼','树','树枝','莲子','水草','荷叶','花','青草','鲜花','荆棘','水龙头','打猎弓','红色拖拉机','旧汽车','画笔','积木','吹风机','机器人','捕贼夹','木桥','盒子']
try:
    i = 0
    while True:
        a = f.readline()
        if a:
            b = a.split()
            if b[0] in Yixiang:
                print(b)
            i = i+1
        else:
            break
finally:
    print(i)
    f.close()

#data1 = np.loadtxt('D:/test.txt', delimiter='\t')